# Pandas

In [1]:
# used for data manipulation and analysis
# also  for visualisation
# * is used to make bullet points

In [2]:
import pandas as pd

* Series------1d array
* Data frame----2d array(table format, row and column)

# Series

In [3]:
a=pd.Series([])
b=pd.Series([1,2,33,47,58,100])
c=pd.Series((45,89,20,30,44))
d=pd.Series({'a':10,'b':15,'c':56,'d':69})

C:\Users\jaisw\AppData\Local\Temp\ipykernel_15028\427388132.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [4]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [5]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [6]:
a

Series([], dtype: float64)

In [7]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [8]:
d

a    10
b    15
c    56
d    69
dtype: int64

In [9]:
import numpy as np
n= np.array([1,2,3,4,40])
x=pd.Series(n)

In [10]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [11]:
type(x)

pandas.core.series.Series

In [12]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [13]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [14]:
b[0]

1

In [15]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [16]:
d

a    10
b    15
c    56
d    69
dtype: int64

In [17]:
d['d']

69

In [18]:
d['b':'d']

b    15
c    56
d    69
dtype: int64

In [19]:
s=pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [20]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [21]:
s1=pd.Series([12,52,42,10,23],index=list('qwert'))

In [22]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [23]:
s2=pd.Series([12,12,12,52,42,10,10,23])

In [24]:
s2

0    12
1    12
2    12
3    52
4    42
5    10
6    10
7    23
dtype: int64

In [25]:
s2.value_counts()

12    3
10    2
52    1
42    1
23    1
dtype: int64

In [26]:
s2.argmax()

3

In [27]:
s2.argmin()

5

In [28]:
s1.argmax()

1

In [29]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [30]:
s1.idxmax()

'w'

In [31]:
s1.idxmin()

'r'

# Data Frame

In [32]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,55,40,86])

In [33]:
a

Empty DataFrame
Columns: []
Index: []

In [34]:
b
# above 0 represents 0th column

    0
0   1
1   2
2  55
3  40
4  86

In [35]:
type(b)

pandas.core.frame.DataFrame

In [36]:
c=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [37]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [38]:
harshita=pd.DataFrame([['a','b','c','d','e'],['f','g','h','i','j'],['k','l','m','n','o'],['p','q','r','s','t'],['u','v','w','x','y'],[1,2,3,4,5]])

In [39]:
harshita

   0  1  2  3  4
0  a  b  c  d  e
1  f  g  h  i  j
2  k  l  m  n  o
3  p  q  r  s  t
4  u  v  w  x  y
5  1  2  3  4  5

In [40]:
# head will return first five dataframe (by default)
harshita.head()

   0  1  2  3  4
0  a  b  c  d  e
1  f  g  h  i  j
2  k  l  m  n  o
3  p  q  r  s  t
4  u  v  w  x  y

In [41]:
# tail will return last five dataframe (by default)
harshita.tail()

   0  1  2  3  4
1  f  g  h  i  j
2  k  l  m  n  o
3  p  q  r  s  t
4  u  v  w  x  y
5  1  2  3  4  5

In [42]:
#  will return last three dataframe 
harshita.tail(3)

   0  1  2  3  4
3  p  q  r  s  t
4  u  v  w  x  y
5  1  2  3  4  5

In [43]:
harshita.sample(5)

   0  1  2  3  4
2  k  l  m  n  o
1  f  g  h  i  j
0  a  b  c  d  e
3  p  q  r  s  t
5  1  2  3  4  5

In [44]:
c1=pd.DataFrame([[1,2],[10,np.nan,30],[7,8]])

In [45]:
c1

    0    1     2
0   1  2.0   NaN
1  10  NaN  30.0
2   7  8.0   NaN

In [46]:
c2=pd.DataFrame([[1],[10,np.nan,30],[7,8]])

In [47]:
c2

    0    1     2
0   1  NaN   NaN
1  10  NaN  30.0
2   7  8.0   NaN

In [48]:
c3=pd.DataFrame([[1],[10,np.nan,30],[7,8]],columns=['colA','colB','colC'])

In [49]:
c3

   colA  colB  colC
0     1   NaN   NaN
1    10   NaN  30.0
2     7   8.0   NaN

In [50]:
c3[['colB','colC']]

   colB  colC
0   NaN   NaN
1   NaN  30.0
2   8.0   NaN

In [51]:
c3[['colB','colC']].head(3)

   colB  colC
0   NaN   NaN
1   NaN  30.0
2   8.0   NaN

In [52]:
c3[['colB','colC']][1:4]

   colB  colC
1   NaN  30.0
2   8.0   NaN

In [53]:
c3.shape

(3, 3)

In [54]:
c3[['colA']].max()

colA    10
dtype: int64

In [55]:
c3['New_Col']=[12,45,55]

In [56]:
c3

   colA  colB  colC  New_Col
0     1   NaN   NaN       12
1    10   NaN  30.0       45
2     7   8.0   NaN       55

In [57]:
c3['New_Col2']=[122,425,525]

In [58]:
c3

   colA  colB  colC  New_Col  New_Col2
0     1   NaN   NaN       12       122
1    10   NaN  30.0       45       425
2     7   8.0   NaN       55       525

* for displaying the values greater than a particular number

In [59]:
c4=c3['New_Col2']>500
c3[c4]

   colA  colB  colC  New_Col  New_Col2
2     7   8.0   NaN       55       525

* For sum of two particular columns and adding another column for sum

In [60]:
c3['colE']=c3['New_Col']+c3['New_Col2']

In [61]:
c3

   colA  colB  colC  New_Col  New_Col2  colE
0     1   NaN   NaN       12       122   134
1    10   NaN  30.0       45       425   470
2     7   8.0   NaN       55       525   580

### Day 10,11

In [62]:
movies=pd.read_clipboard()

EmptyDataError: No columns to parse from file

In [ ]:
movies

In [ ]:
# index_col=INDEX will replace original indexing (whichwas automatic from 0) with the column at INDEX(which is here ID)
movies=pd.read_csv(r'ML with python Training Day 10.csv.csv',index_col=0)

In [ ]:
movies

#### 1.Find the longest movie name

In [ ]:
movies['NAME'][movies['DURATION'].argmax()]

#### 2. No. of movies which got 10 ratings

In [ ]:
sum(movies['RATINGS']==10)

#### 3. How many industries are there

In [ ]:
movies['INDUSTRY'].value_counts().count()

In [ ]:
len(movies['INDUSTRY'].value_counts())

In [ ]:
movies['INDUSTRY'].nunique()

#### 4. Least liked comedy movie

In [ ]:
movies['NAME'][movies[movies['GENRE']=='Comedy']['RATINGS'].idxmin()]

#### 5. Longest english movie

In [ ]:
movies['NAME'][movies[movies['LANGUAGE']=='English']['DURATION'].idxmax()]

#### 6. Genre of Intersteller

In [ ]:
# .values[] change into numpy ARRAY
movies['GENRE'][movies['NAME']=='Intersteller'].values[0]

In [ ]:
# to use string functions in series we can use . str
movies['GENRE'][movies['NAME'].str.lower()=='Intersteller'.lower()].values[0]

In [ ]:
names= movies['NAME']

In [ ]:
names.to_list()

In [ ]:
names.str.get(0)

* get_dummies()

In [ ]:
# covert string data to numeric data
names.str.get_dummies()

In [ ]:
movies['GENRE'].str.get_dummies()

In [ ]:
names.str.split('e').str.join('*')

In [ ]:
#leading and trailing characters(especially spaces by default) can be removed
names.str.strip()

#### 7. Avg duration of each Genre

In [ ]:
movies['GENRE'].unique()

In [ ]:
movies['GENRE'].nunique()

In [ ]:
movies['GENRE'].value_counts()

In [ ]:
for GENRE in movies['GENRE'].unique():
    print(GENRE,movies[movies['GENRE']==GENRE]['DURATION'].mean())

In [ ]:
# another method
movies.groupby('GENRE')['DURATION'].mean()

* groupby()

In [ ]:
movies.groupby(['GENRE','INDUSTRY'])['DURATION'].mean()

In [ ]:
# describe() will display only nemeric data
movies.describe()

In [ ]:
# inplace replaces all process done with original movies
    #movies.drop('ID', axis=1, inplace=True)

In [ ]:
#movies

In [ ]:
movies.describe(include='all')

In [ ]:
# .T transposes the dataframe
movies.groupby('INDUSTRY').describe().T

In [ ]:
movies.groupby(['INDUSTRY','GENRE']).describe().T

### 8. Avg. rating of each industry

In [ ]:
movies.groupby('INDUSTRY')['RATINGS'].mean()

### 9. Avg rating of romantic movies industry wise

In [ ]:
movies[movies['GENRE'].str.lower()=='romantic']

In [ ]:
movies[movies['GENRE'].str.lower()=='romantic'].groupby(['GENRE','INDUSTRY'])['RATINGS'].mean()

### 10. List down all english movies with their respective ratings in descending order

In [ ]:
movies[movies['LANGUAGE'].str.lower()=='english'][['NAME','RATINGS']].sort_values(by='RATINGS',ascending=False)

# Day 12

* 1. Pivot Table
*2. Pandas concat
* 3. Pandas Merge
* 4. Pandas join

In [69]:
import numpy as np

In [76]:
data={'Country':['India','USA','Japan','China','India','USA'],
      'Year':['2010','2010','2010','2015','2015','2015'],
      'Continent':['Asia','NA','Asia','Asia','Asia','NA'],'Value':[20,10,40,50,60,55]
     }

In [77]:
df=pd.DataFrame(data)

In [78]:
df

  Country  Year Continent  Value
0   India  2010      Asia     20
1     USA  2010        NA     10
2   Japan  2010      Asia     40
3   China  2015      Asia     50
4   India  2015      Asia     60
5     USA  2015        NA     55

In [75]:
pd.pivot_table(df,index=['Year'],aggfunc='sum')

      Value
Year
2010     70
2015    165

In [80]:
pd.pivot_table(df,index=['Continent'],aggfunc='sum')

           Value
Continent
Asia         170
NA            65

### Concat(When column names are same)

In [95]:
people1={'id':[1,2,3,4],
        'name':['Harshita','Gajal','Lipakshi','Kalpit'],
        'age':[19,18,17,20]}

In [96]:
people2={'id':[5,6,7,8],
        'name':['a','b','c','d'],
        'age':[35,15,40,35]}

In [97]:
people3={'id':[9,10,11,12],
        'name':['e','f','g','h'],
        'age':[55,75,81,50]}

In [98]:
df1=pd.DataFrame(people1)
df2=pd.DataFrame(people2)
df3=pd.DataFrame(people3)

In [99]:
df1

   id      name  age
0   1  Harshita   19
1   2     Gajal   18
2   3  Lipakshi   17
3   4    Kalpit   20

In [100]:
df2

   id name  age
0   5    a   35
1   6    b   15
2   7    c   40
3   8    d   35

In [101]:
df3

   id name  age
0   9    e   55
1  10    f   75
2  11    g   81
3  12    h   50

In [102]:
pd.concat([df1,df2,df3])

   id      name  age
0   1  Harshita   19
1   2     Gajal   18
2   3  Lipakshi   17
3   4    Kalpit   20
0   5         a   35
1   6         b   15
2   7         c   40
3   8         d   35
0   9         e   55
1  10         f   75
2  11         g   81
3  12         h   50

In [103]:
pd.concat([df1,df2,df3],ignore_index=True)

    id      name  age
0    1  Harshita   19
1    2     Gajal   18
2    3  Lipakshi   17
3    4    Kalpit   20
4    5         a   35
5    6         b   15
6    7         c   40
7    8         d   35
8    9         e   55
9   10         f   75
10  11         g   81
11  12         h   50

In [104]:
pd.concat([df1,df2,df3],axis=1)

   id      name  age  id name  age  id name  age
0   1  Harshita   19   5    a   35   9    e   55
1   2     Gajal   18   6    b   15  10    f   75
2   3  Lipakshi   17   7    c   40  11    g   81
3   4    Kalpit   20   8    d   35  12    h   50

### Merge(When some values are same and some other column is also there in some dataframe)

In [105]:
people4={'id':[9,10,11,12],
        'name':['e','f','g','h'],
        'age':[55,75,81,50]}
people5={'id':[9,10,11,12],
        'name':['e','f','g','h'],
        'sales':[555,735,811,530]}

In [106]:
df4=pd.DataFrame(people4)

In [107]:
df5=pd.DataFrame(people5)

In [109]:
pd.merge(df4,df5,on=['id','name'])

   id name  age  sales
0   9    e   55    555
1  10    f   75    735
2  11    g   81    811
3  12    h   50    530

In [110]:
pd.merge(df4,df5,on=['id'])

   id name_x  age name_y  sales
0   9      e   55      e    555
1  10      f   75      f    735
2  11      g   81      g    811
3  12      h   50      h    530

### Join(When everything is different)

In [113]:
people6={'id':[13,14,15,16],
        'name':['i','j','k','l'],
        'age':[56,76,82,51]}
people7={'s_name':['aa','bb','cc','dd'],
        'ph':[12345,67890,11121314,151617]}

In [114]:
df6=pd.DataFrame(people6)
df7=pd.DataFrame(people7)

In [115]:
df6.join(df7)

   id name  age s_name        ph
0  13    i   56     aa     12345
1  14    j   76     bb     67890
2  15    k   82     cc  11121314
3  16    l   51     dd    151617

In [117]:
d1=pd.read_csv('mytsv.tsv',sep='\t')

In [118]:
d1

       name       age  roll
0   'akash'        21   100
1  'akshat'        22   101
2   'sunny'        20   102
3   'bunny'        25   103
4  'ashish'        24   104

In [119]:
d2=pd.read_csv('mysemi.txt',sep=';')

In [120]:
d2

       name  age  roll
0   'akash'   21   100
1  'akshat'   22   101
2   'sunny'   20   102
3   'bunny'   25   103
4  'ashish'   24   104

#### Creating a json file

In [122]:
df6

   id name  age
0  13    i   56
1  14    j   76
2  15    k   82
3  16    l   51

In [125]:
df6.to_json('myjason.json')

In [129]:
d4=pd.read_json('myjason.json')

In [130]:
d4

   id name  age
0  13    i   56
1  14    j   76
2  15    k   82
3  16    l   51

In [131]:
df5

   id name  sales
0   9    e    555
1  10    f    735
2  11    g    811
3  12    h    530

In [132]:
df5.to_csv('mycsv.csv')